{
  "irVersion": "1.0",
  "project": "tavus-go",
  "repository": "https://github.com/plexusone/tavus-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "unreleased": {},
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-07-19",
      "highlights": [
        { "description": "OmniAvatar render adapter — use Tavus video generation behind the provider-agnostic OmniAvatar interfaces" },
        { "description": "Interactive Scalar API reference deployed to GitHub Pages" }
      ],
      "added": [
        { "description": "`omniavatar` subpackage: an OmniAvatar render adapter implementing the omniavatar-core `render.Provider` interface on top of this SDK; depends only on omniavatar-core", "commit": "e60b13a" }
      ],
      "dependencies": [
        { "description": "Require `omniavatar-core` v0.3.0 for the render adapter", "commit": "d555c7e" },
        { "description": "Bump `github.com/ogen-go/ogen` to v1.23.0", "commit": "d5966c6" }
      ],
      "documentation": [
        { "description": "Interactive API reference via Scalar at https://plexusone.github.io/tavus-go/", "commit": "627bc06" },
        { "description": "README OmniAvatar Integration section", "commit": "9d6f398" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions workflow for GitHub Pages (Scalar) deployment", "commit": "627bc06" },
        { "description": "Bump GitHub Actions: deploy-pages v5, upload-pages-artifact v5, checkout v7, configure-pages v6", "commit": "cc30789" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-07-06",
      "commit": "d053186",
      "highlights": [
        { "description": "Public API types for external package integration" },
        { "description": "Multi-provider LLM support via omnillm-core in examples" },
        { "description": "Custom LLM backend examples for Tavus integration" }
      ],
      "breaking": [
        { "description": "API types moved from `internal/api` to `api` - import path changed", "commit": "d053186" }
      ],
      "added": [
        { "description": "Custom LLM backend example showing PAL configuration with external LLM", "commit": "e8f568e" },
        { "description": "OpenAI-compatible custom LLM server example", "commit": "e8f568e" }
      ],
      "changed": [
        { "description": "Custom LLM server example now uses omnillm-core for multi-provider support (OpenAI, Anthropic, X.AI, Ollama, etc.)", "commit": "770434b" }
      ],
      "refactored": [
        { "description": "Moved ogen-generated API types from `internal/api` to `api` for external package access", "commit": "d053186" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-07-06",
      "commit": "3733f84",
      "highlights": [
        { "description": "Initial release of Go SDK for Tavus API with full CVI (Conversational Video Interface) support" },
        { "description": "Spec-driven development using OpenAPI 3.0.3 and ogen code generation" },
        { "description": "High-level service wrappers for all 10 Tavus resource types" }
      ],
      "added": [
        { "description": "Comprehensive OpenAPI 3.0.3 spec covering all Tavus API v2 endpoints", "commit": "45ea7b8" },
        { "description": "ogen-generated API client with type-safe request/response handling", "commit": "1db11a7" },
        { "description": "SDK client wrapper with functional options (API key, base URL, timeout, HTTP client)", "commit": "3ecd8b3" },
        { "description": "Environment variable support via `TAVUS_API_KEY`", "commit": "3ecd8b3" },
        { "description": "SDK version headers (`X-Tavus-SDK-Version`, `X-Tavus-SDK-Lang`)", "commit": "3ecd8b3" },
        { "description": "`ConversationsService` for real-time video session management", "commit": "3ecd8b3" },
        { "description": "`PalsService` for Personality AI Layer (PAL) management", "commit": "3ecd8b3" },
        { "description": "`FacesService` for visual identity management", "commit": "3ecd8b3" },
        { "description": "`VoicesService` for stock voice listing", "commit": "3ecd8b3" },
        { "description": "`VideosService` for async video generation", "commit": "3ecd8b3" },
        { "description": "`ToolsService` for function calling tool management", "commit": "3ecd8b3" },
        { "description": "`GuardrailsService` for behavioral boundary management", "commit": "3ecd8b3" },
        { "description": "`ObjectivesService` for conversation goal management", "commit": "3ecd8b3" },
        { "description": "`DocumentsService` for knowledge base management", "commit": "3ecd8b3" },
        { "description": "`DeploymentsService` for distribution channel management", "commit": "3ecd8b3" },
        { "description": "Usage examples: basic conversation, PAL management, tool calling, resource listing", "commit": "895847b" }
      ],
      "build": [
        { "description": "ogen code generation tooling with `generate.sh` script", "commit": "e4dc55d" },
        { "description": "Post-processing with ogen-fixnull and ogen-fixerror from plexusone/ogen-tools", "commit": "e4dc55d" }
      ],
      "tests": [
        { "description": "Unit tests for client construction, options, and service accessors", "commit": "3350c2a" },
        { "description": "Integration tests for all 10 services (skips gracefully without `TAVUS_API_KEY`)", "commit": "3350c2a" }
      ],
      "documentation": [
        { "description": "README with installation, quick start, and all service examples", "commit": "7bc4a91" },
        { "description": "Examples README with usage instructions", "commit": "895847b" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions workflows for CI/CD", "commit": "3733f84" },
        { "description": "golangci-lint configuration", "commit": "e9176e0" }
      ]
    }
  ]
}
